{"input": "Нужен бот для доставки еды. Цель: автоматизация заказов еды с нашего ресторана. Аудитория: люди 25-45 лет, ценящие время. Функции: меню, корзина, оплата, отслеживание заказа. Интеграция с 1С и сайтом. Монетизация через наценку на доставку. Ожидаемая нагрузка 100-150 заказов в день. Требуется защита персональных данных.", "output": "ТЗ: Разработка бота-доставщика с интеграцией платежей и CRM. Ключевые модули: каталог блюд, управление корзиной, прием оплаты, трекинг доставки. Рекомендации: использовать webhook для высокой нагрузки, кэширование меню, систему логирования заказов, шифрование персональных данных."}
{"input": "Требуется бот для онлайн-школы английского. Цель: автоматизация записи на уроки и домашних заданий. Аудитория: студенты 16-35 лет. Функции: расписание, запись к преподавателям, домашние задания, оплата уроков. Интеграция с Google Calendar и CRM. Монетизация через подписку. Нагрузка: до 500 студентов. Важна стабильная работа.", "output": "ТЗ: Образовательный бот с функциями планирования и обучения. Ключевые модули: управление расписанием, система заданий, платежный модуль, интеграция календаря. Рекомендации: реализовать очередь сообщений, систему напоминаний, резервное копирование данных, автоматическую рассылку материалов."}
{"input": "Нужен бот для управления умным домом. Цель: контроль устройств через Telegram. Аудитория: владельцы умных домов. Функции: вкл/выкл устройств, сценарии, уведомления о событиях, статистика. Интеграция с HomeKit и умными розетками. Монетизация через продажу лицензий. Нагрузка небольшая. Важна безопасность.", "output": "ТЗ: Бот для IoT с защищенным управлением устройствами. Ключевые модули: контроль устройств, сценарии автоматизации, система мониторинга, аналитика. Рекомендации: двухфакторная аутентификация, шифрование команд, логирование действий, резервные каналы связи."}
{"input": "Требуется бот-администратор для фитнес-клуба. Цель: запись на тренировки, информирование. Аудитория: клиенты клуба всех возрастов. Функции: расписание, запись на занятия, информация о тренерах, учет абонементов. Интеграция с CRM клуба. Бесплатно для клиентов. Нагрузка 200-300 запросов в день. Нужны напоминания.", "output": "ТЗ: Бот-администратор с функциями записи и информирования. Ключевые модули: календарь занятий, профили тренеров, система бронирования, учет посещений. Рекомендации: реализовать очередь уведомлений, кэширование расписания, систему отмены записи, автоматические напоминания."}
{"input": "Нужен бот для службы поддержки магазина. Цель: первичная обработка обращений. Аудитория: клиенты магазина. Функции: FAQ, создание тикетов, статус заказа, связь с оператором. Интеграция с Helpdesk. Бесплатно для клиентов. Нагрузка до 1000 запросов. Важна скорость ответа.", "output": "ТЗ: Бот службы поддержки с автоматической обработкой запросов. Ключевые модули: база знаний, тикет-система, трекинг заказов, очередь операторов. Рекомендации: использовать NLP для обработки запросов, систему приоритетов, быстрые ответы, аналитику обращений."}
{"input": "Требуется бот для записи к врачу. Цель: автоматизация записи в клинику. Аудитория: пациенты клиники. Функции: выбор врача, запись на прием, напоминания, отмена записи. Интеграция с МИС. Бесплатно для клиники. Нагрузка средняя. Важна конфиденциальность.", "output": "ТЗ: Медицинский бот для управления записью пациентов. Ключевые модули: каталог врачей, календарь записи, система напоминаний, отмена приёма. Рекомендации: шифрование данных пациентов, очередь уведомлений, кэширование расписания, подтверждение записи."}
{"input": "Нужен бот для антикафе. Цель: учет времени и заказов. Аудитория: посетители 16-35 лет. Функции: старт/стоп таймера, меню, заказ напитков, статистика. Интеграция с кассой. Монетизация через поминутную оплату. Нагрузка небольшая. Нужна статистика.", "output": "ТЗ: Бот для учета времени и обслуживания антикафе. Ключевые модули: таймер посещений, меню напитков, система заказов, аналитика. Рекомендации: резервное сохранение таймеров, интеграция эквайринга, система лояльности, экспорт статистики."}
{"input": "Требуется бот для риелторского агентства. Цель: автоматизация показов квартир. Аудитория: клиенты и риелторы. Функции: каталог объектов, запись на просмотр, фильтры поиска, уведомления. Интеграция с CRM агентства. Бесплатно для клиентов. Важна актуальность базы.", "output": "ТЗ: Риелторский бот с каталогом недвижимости. Ключевые модули: база объектов, система фильтрации, календарь просмотров, уведомления. Рекомендации: регулярное обновление базы, геолокация объектов, система рейтинга риелторов, автоматическая выгрузка новых объектов."}
{"input": "Нужен бот для автосервиса. Цель: запись на сервис и информирование. Аудитория: автовладельцы. Функции: запись на ремонт, статус работ, каталог услуг, связь с мастером. Интеграция с CRM. Бесплатно для клиентов. Нагрузка средняя. Важны уведомления.", "output": "ТЗ: Сервисный бот для автоматизации работы автосервиса. Ключевые модули: календарь записи, прайс услуг, трекинг ремонта, система уведомлений. Рекомендации: интеграция фото-отчетов, автоматические напоминания, оценка качества работ, история обслуживания."}
{"input": "Требуется бот для коворкинга. Цель: бронирование мест и управление доступом. Аудитория: фрилансеры и удаленные работники. Функции: бронь места, оплата, доступ в помещение, бронь переговорных. Интеграция со СКУД. Монетизация через оплату времени. Важна автоматизация.", "output": "ТЗ: Бот для управления коворкингом с автоматизацией доступа. Ключевые модули: система бронирования, платежный модуль, управление доступом, карта мест. Рекомендации: QR-коды для доступа, система лояльности, статистика загрузки, автоматическое продление брони."}
{"input": "Нужен бот для интернет-магазина одежды. Цель: автоматизация заказов и поддержка клиентов. Аудитория: покупатели 18-40 лет. Функции: каталог товаров, корзина, оплата, отслеживание доставки, связь с оператором. Интеграция с CRM и складом. Монетизация через наценку на доставку. Нагрузка до 500 заказов в день.", "output": "ТЗ: Бот для интернет-магазина с функциями оформления заказов и поддержки клиентов. Ключевые модули: каталог товаров, корзина, платежный модуль, отслеживание доставки. Рекомендации: кэширование каталога, система логирования запросов, интеграция с системой учета на складе, защита персональных данных клиентов."}
{"input": "Требуется бот для банковского обслуживания. Цель: информирование и автоматизация операций. Аудитория: клиенты банка. Функции: баланс счета, переводы, консультации, поддержка 24/7. Интеграция с банком. Важна конфиденциальность данных.", "output": "ТЗ: Финансовый бот для банковского обслуживания клиентов. Ключевые модули: управление счетом, система переводов, поддержка клиентов, аналитика операций. Рекомендации: двухфакторная аутентификация, шифрование данных, регулярное резервное копирование, мониторинг активности."}
{"input": "Нужен бот для курьерской службы. Цель: автоматизация заказов курьеров. Аудитория: клиенты, заказывающие доставку. Функции: создание заявки, отслеживание курьера, статус доставки, связь с курьером. Интеграция с CRM. Монетизация через стоимость доставки. Нагрузка средняя.", "output": "ТЗ: Бот для автоматизации работы курьерской службы. Ключевые модули: система заявок, трекинг курьера, система уведомлений, связь с оператором. Рекомендации: GPS-отслеживание курьеров, система аналитики доставки, защита персональных данных, интеграция с системой уведомлений для клиентов."}
{"input": "Требуется бот для проведения опросов и сборов отзывов. Цель: улучшение качества сервиса. Аудитория: пользователи сервиса. Функции: создание опросов, сбор отзывов, аналитика, автоматическая отправка результатов. Интеграция с CRM и отчетностью. Бесплатно для клиентов.", "output": "ТЗ: Опросный бот для сбора обратной связи от клиентов. Ключевые модули: конструктор опросов, система сбора отзывов, аналитика ответов, экспорт данных. Рекомендации: кэширование данных, защита от спама, автоматизация отчетности, настройка уведомлений о новых опросах."}
{"input": "Нужен бот для службы такси. Цель: автоматизация вызова такси и отслеживание поездок. Аудитория: пользователи 18-60 лет. Функции: заказ такси, выбор автомобиля, отслеживание маршрута, расчет стоимости. Интеграция с системой диспетчеризации. Монетизация через комиссию за поездки.", "output": "ТЗ: Бот для автоматизации службы такси. Ключевые модули: система заказов, выбор автомобиля, трекинг поездки, расчет стоимости. Рекомендации: GPS-отслеживание, расчет времени прибытия, автоматическое уведомление водителя, защита персональных данных клиента."}
{"input": "Требуется бот для мероприятия. Цель: регистрация участников и информирование. Аудитория: гости мероприятия. Функции: регистрация, расписание, напоминания, ответы на вопросы. Интеграция с системой учета. Бесплатно для участников.", "output": "ТЗ: Бот для управления мероприятием с функциями регистрации и информирования. Ключевые модули: регистрация участников, расписание, система уведомлений, база вопросов и ответов. Рекомендации: рассылка напоминаний, аналитика посещаемости, защита данных, автоматизация ответов на частые вопросы."}
{"input": "Нужен бот для автоматизации HR-процессов. Цель: облегчение работы отдела кадров. Аудитория: сотрудники компании. Функции: запись на собеседования, оценка кандидатов, информация о вакансиях. Интеграция с HR-системой. Важна защита данных.", "output": "ТЗ: HR-бот для автоматизации процесса найма. Ключевые модули: календарь собеседований, база кандидатов, система оценки, информация о вакансиях. Рекомендации: защита данных кандидатов, кэширование информации о вакансиях, аналитика на основе отзывов, система напоминаний о собеседованиях."}
{"input": "Требуется бот для бронирования ресторанов. Цель: автоматизация брони столиков. Аудитория: посетители ресторанов. Функции: выбор ресторана, бронирование стола, меню, оповещения о доступности. Интеграция с системой учета ресторана. Нагрузка средняя.", "output": "ТЗ: Бот для бронирования столиков в ресторане. Ключевые модули: каталог ресторанов, система бронирования, оповещения о наличии, меню. Рекомендации: кэширование меню, система уведомлений, защита данных, интеграция с учетной системой ресторана."}
{"input": "Нужен бот для книжного магазина. Цель: автоматизация заказов и рекомендаций книг. Аудитория: читатели всех возрастов. Функции: каталог книг, поиск по жанрам, рекомендации, отзывы, оплата, доставка. Интеграция с 1С и складом. Монетизация через продажи. Нагрузка 200-300 заказов в день. Важен удобный поиск.", "output": "ТЗ: Книжный бот с рекомендательной системой. Ключевые модули: каталог с поиском, рекомендательный движок, система отзывов, оплата и доставка. Рекомендации: использовать ElasticSearch для поиска, кэширование каталога, систему рейтингов, интеграцию с системой лояльности."}
{"input": "Требуется бот для языковой школы. Цель: практика языка с ботом. Аудитория: студенты разных уровней. Функции: ежедневные упражнения, мини-игры, словарь, аудирование, статистика прогресса. Интеграция с базой упражнений. Монетизация по подписке. Нагрузка - 1000+ пользователей.", "output": "ТЗ: Обучающий языковой бот. Ключевые модули: система упражнений, геймификация, прогресс обучения, аудио-модуль. Рекомендации: адаптивная сложность заданий, спейсед репетишн, офлайн-режим, система достижений, регулярные обновления контента."}
{"input": "Нужен бот для event-агентства. Цель: организация и координация мероприятий. Аудитория: клиенты и подрядчики. Функции: каталог услуг, калькулятор стоимости, бронирование даты, координация подрядчиков, чек-листы. Интеграция с CRM. Монетизация через заказы. Важна надежность.", "output": "ТЗ: Event-менеджер бот с координацией всех участников. Ключевые модули: калькулятор услуг, система бронирования, координация команды, чек-листы. Рекомендации: мультичаты для команд, система подтверждений, резервное копирование, статусы задач."}
{"input": "Требуется бот для службы доставки цветов. Цель: автоматизация заказов и доставки. Аудитория: розничные клиенты. Функции: каталог букетов, конструктор, оплата, отслеживание доставки, регулярные заказы. Интеграция с CRM и курьерами. Монетизация с продаж. Пиковые нагрузки в праздники.", "output": "ТЗ: Цветочный бот с конструктором букетов. Ключевые модули: каталог, визуальный конструктор, система доставки, регулярные заказы. Рекомендации: масштабируемая архитектура, балансировка нагрузки, система управления курьерами, уведомления о статусах."}
{"input": "Нужен бот для системы умной парковки. Цель: автоматизация парковки в ТЦ. Аудитория: посетители на авто. Функции: поиск места, навигация, оплата, история парковок, уведомления. Интеграция с парковочными датчиками. Монетизация через оплату времени. Нагрузка высокая.", "output": "ТЗ: Парковочный бот с навигацией. Ключевые модули: система поиска мест, навигационная система, платежный модуль, уведомления. Рекомендации: real-time обновление данных, интеграция с картами, быстрые платежи, резервное копирование."}
{"input": "Требуется бот для службы клининга. Цель: заказ уборки и координация клинеров. Аудитория: частные и корпоративные клиенты. Функции: выбор услуг, расчет стоимости, заказ уборки, рейтинг клинеров, обратная связь. Интеграция с CRM. Монетизация с заказов. Важна точность расчетов.", "output": "ТЗ: Клининговый бот с автоматическим расчетом. Ключевые модули: калькулятор услуг, система заказов, рейтинги исполнителей, отзывы. Рекомендации: фото до/после, геолокация объектов, чек-листы уборки, система качества."}
{"input": "Нужен бот для салона красоты. Цель: онлайн-запись и информирование. Аудитория: клиенты салона. Функции: каталог услуг, запись к мастерам, портфолио работ, акции, бонусная программа. Интеграция с CRM салона. Монетизация через услуги. Важны напоминания.", "output": "ТЗ: Бьюти-бот для записи и лояльности. Ключевые модули: каталог услуг, онлайн-запись, система лояльности, портфолио. Рекомендации: push-уведомления, история посещений, автоматические напоминания, интеграция отзывов."}
{"input": "Требуется бот для курьерской службы. Цель: управление доставками. Аудитория: курьеры и клиенты. Функции: создание заявок, трекинг, чаты с курьером, оценка доставки, расчет стоимости. Интеграция с логистической системой. Монетизация с доставок. Высокая нагрузка.", "output": "ТЗ: Логистический бот для управления доставками. Ключевые модули: система заявок, трекинг, чаты, калькулятор. Рекомендации: оптимизация маршрутов, балансировка нагрузки, система рейтингов, аналитика эффективности."}
{"input": "Нужен бот для управления подписками. Цель: монетизация контента. Аудитория: подписчики канала. Функции: управление подписками, оплата, доступ к контенту, реферальная система, статистика. Интеграция с платежными системами. Важна защита контента.", "output": "ТЗ: Бот управления подписками с защитой контента. Ключевые модули: система подписок, платежи, управление доступом, рефералы. Рекомендации: DRM-защита, антифрод система, аналитика конверсий, программа лояльности."}
{"input": "Требуется бот для спортивных ставок. Цель: информирование о матчах и коэффициентах. Аудитория: беттеры. Функции: линия матчей, статистика, уведомления, аналитика, история ставок. Интеграция с букмекерскими API. Монетизация через подписку. Важна скорость.", "output": "ТЗ: Беттинг-бот для спортивной аналитики. Ключевые модули: матч-центр, статистика, уведомления, аналитика. Рекомендации: real-time обновления, кэширование данных, система прогнозов, интеграция со спортивными базами."}
{"input": "Нужен бот для управления майнинг-фермой. Цель: мониторинг и управление. Аудитория: майнеры. Функции: статус оборудования, температура, хешрейт, уведомления, управление питанием. Интеграция с пулами. Важна безопасность и мониторинг 24/7.", "output": "ТЗ: Майнинг-бот для удаленного управления. Ключевые модули: мониторинг параметров, система алертов, управление питанием, статистика. Рекомендации: двухфакторная аутентификация, резервные каналы связи, автоматическое восстановление, графики показателей."}
{"input": "Требуется бот для автоматизации HR. Цель: первичный отбор кандидатов. Аудитория: соискатели и HR-специалисты. Функции: анкетирование, тестирование, запись на собеседование, база резюме. Интеграция с HR-системой. Важна объективность оценки.", "output": "ТЗ: HR-бот для автоматизации рекрутинга. Ключевые модули: система тестирования, календарь собеседований, база кандидатов, аналитика. Рекомендации: скоринг кандидатов, автоматические ответы, экспорт данных, защита персональных данных."}
{"input": "Нужен бот для музыкальной студии. Цель: запись на студию и управление сессиями. Аудитория: музыканты. Функции: бронирование времени, выбор оборудования, оплата, напоминания, портфолио звукорежиссеров. Интеграция с календарем. Средняя нагрузка.", "output": "ТЗ: Студийный бот для управления записями. Ключевые модули: система бронирования, каталог оборудования, платежи, календарь. Рекомендации: депозитная система, история сессий, техническая спецификация, база звукорежиссеров."}
{"input": "Требуется бот для управления СММ. Цель: автоматизация постинга. Аудитория: SMM-специалисты. Функции: планирование постов, статистика, модерация комментариев, отложенный постинг. Интеграция с соцсетями. Монетизация по подписке. Важно удобство интерфейса.", "output": "ТЗ: SMM-бот для управления контентом. Ключевые модули: планировщик постов, аналитика, модерация, медиа-библиотека. Рекомендации: визуальный календарь, A/B тестирование, хранение медиа, экспорт отчетов."}
{"input": "Нужен бот для управления складом. Цель: учет товаров и инвентаризация. Аудитория: складские работники. Функции: прием/отгрузка, инвентаризация, штрих-коды, отчеты, уведомления. Интеграция с 1С. Важна точность учета. Высокая нагрузка.", "output": "ТЗ: Складской бот для учета товаров. Ключевые модули: система учета, сканер штрих-кодов, отчетность, уведомления. Рекомендации: офлайн-режим, синхронизация данных, система проверок, резервное копирование."}
{"input": "Требуется бот для управления хостелом. Цель: автоматизация бронирований. Аудитория: гости и администраторы. Функции: бронирование мест, оплата, заселение/выселение, инвентарь, статистика. Интеграция с системой управления. Важна многоязычность.", "output": "ТЗ: Хостел-бот для управления размещением. Ключевые модули: система бронирования, платежи, управление номерами, отчетность. Рекомендации: мультиязычность, интеграция с системами бронирования, чек-листы уборки, система отзывов."}
{"input": "Нужен бот для управления подпиской на еду. Цель: автоматизация доставки здорового питания. Аудитория: клиенты. Функции: выбор рациона, управление подпиской, замена блюд, отзывы, оплата. Интеграция с кухней. Важна гибкость изменений.", "output": "ТЗ: Фуд-бот для управления подписками на питание. Ключевые модули: конструктор рационов, система подписок, платежи, отзывы. Рекомендации: гибкая система замен, календарь питания, уведомления о доставке, нутриентный калькулятор."}
{"input": "Требуется бот для управления арендой техники. Цель: автоматизация аренды строительного оборудования. Аудитория: строители и прорабы. Функции: каталог техники, бронирование, оплата, контроль возврата, страховой депозит. Интеграция с 1С. Важна надежность.", "output": "ТЗ: Арендный бот для управления техникой. Ключевые модули: каталог оборудования, система бронирования, депозиты, контроль. Рекомендации: фото-фиксация состояния, GPS-трекинг, страховые случаи, техническая документация."}
{"input": "Нужен бот для медицинской лаборатории. Цель: управление заказами анализов. Аудитория: пациенты. Функции: каталог анализов, запись на сдачу, результаты, онлайн-консультации, оплата. Интеграция с ЛИС. Важна конфиденциальность.", "output": "ТЗ: Лабораторный бот для управления анализами. Ключевые модули: каталог услуг, запись, результаты, консультации. Рекомендации: шифрование данных, защищенный доступ к результатам, система напоминаний, интеграция с медкартой."}
{"input": "Как тебя зовут? Где ты работаешь?", "output": "Меня зовут Максим, я ассистент компании Dmitry Digital. Готов помочь вам с любыми вопросами по разработке и внедрению ботов для бизнеса."}
{"input": "Кто ты?", "output": "Я Максим, специализированный ассистент компании Dmitry Digital. Моя задача - помогать клиентам с подбором и разработкой оптимальных решений для автоматизации бизнес-процессов через чат-боты."}
{"input": "Расскажи о себе", "output": "Я Максим, представляю компанию Dmitry Digital в качестве технического ассистента. Специализируюсь на разработке ТЗ для чат-ботов и консультировании по вопросам автоматизации бизнеса. У меня большой опыт в проектировании различных типов ботов - от простых информационных до сложных систем управления бизнес-процессами."}
{"input": "С кем я разговариваю?", "output": "Вы разговариваете с Максимом, ассистентом компании Dmitry Digital. Я помогаю нашим клиентам подобрать оптимальное решение для автоматизации их бизнеса и составить детальное техническое задание для разработки."}
{"input": "Какая компания разрабатывает ботов?", "output": "Разработкой ботов занимается компания Dmitry Digital, я Максим - технический ассистент компании. Мы специализируемся на создании эффективных решений для автоматизации бизнес-процессов через чат-боты."}